#!/usr/bin/python
# -*- coding:utf-8 -*-
import numpy as np
import cv2 as cv
from matplotlib import pyplot as plt
import random

# 图像金字塔
# 本小节目标
# 学习图像金字塔
# 使用图像创建一个新水果
# 本节函数：cv.pyrUp(),cv.pyrDown()

# 原理：一般情况下，我们要处理一副具有固定分辨率的图像。但是有些时候需要对一副图像的不同分辨率的子图像进行处理。
# 比如要在一副图片中找到某个目标，我们不知道目标在图像中的尺寸大小，这时候需要创建一组图像，这些图像是具有不同分辨率的原始图像，这一组图像叫
# 图像金字塔。
# 图像金字塔有两类：高斯金字塔和拉帕拉斯金字塔。
# 高斯金字塔的顶部是通过将底部图像的连续的行和列去除得到。顶部图像中的每个像素值等于下一层图像中5个像素的高斯加权平均值。
# 这个操作



if __name__ == '__main__':
	pass
	




































